[
{"story_name": "Wolff ‘hoping for a freezing Belgium’ after Mercedes slip back in Hungary heat", "story_url": "https://www.formula1.com/en/latest/article/wolff-left-hoping-for-a-freezing-belgium-after-mercedes-slip-back-in-hungary.GY6gWGeIe2CbmZd4c7JmX"},
{"story_name": "5 Winners and 5 Losers from the Hungarian Grand Prix – Who drove brilliantly in Budapest?", "story_url": "https://www.formula1.com/en/latest/article/5-winners-and-5-losers-from-the-hungarian-grand-prix-who-drove-brilliantly.W0JxUS9J3Ln5wLEb2HgSW"},
{"story_name": "Ricciardo left with ‘a lot of anger’ as he rues RB strategy call that dropped him out of the points in Hungary", "story_url": "https://www.formula1.com/en/latest/article/ricciardo-left-with-a-lot-of-anger-as-he-rues-rb-strategy-call-that-dropped.1YfGiRWsQzYwYi6ISQV6Ze"},
{"story_name": "‘We’ll have discussions behind closed doors’ – Horner defends Verstappen after heated radio outbursts in Hungary", "story_url": "https://www.formula1.com/en/latest/article/well-have-discussions-behind-closed-doors-horner-defends-verstappen-after.4ao9lL0VU7aKYPJGShNGbD"},
{"story_name": "WATCH: How Oscar Piastri stormed the junior categories and became an F1 winner", "story_url": "https://www.formula1.com/en/latest/article/watch-how-oscar-piastri-stormed-the-junior-categories-and-became-an-f1.3g8LYwajSbWDb4PX0eKdas"},
{"race_round": "TESTING", "race_url": "https://www.formula1.com/en/racing/2024/pre-season-testing", "race_date": "21-23 21-23", "location": "Bahrain", "race_fullname": "FORMULA 1 ARAMCO PRE-SEASON TESTING 2024"},
{"race_round": "ROUND 1", "race_url": "https://www.formula1.com/en/racing/2024/bahrain", "race_date": "29-02 FEB-MAR", "location": "Bahrain", "race_fullname": "FORMULA 1 GULF AIR BAHRAIN GRAND PRIX 2024"},
{"race_round": "ROUND 2", "race_url": "https://www.formula1.com/en/racing/2024/saudi-arabia", "race_date": "07-09 MAR", "location": "Saudi Arabia", "race_fullname": "FORMULA 1 STC SAUDI ARABIAN GRAND PRIX 2024"},
{"race_round": "ROUND 3", "race_url": "https://www.formula1.com/en/racing/2024/australia", "race_date": "22-24 MAR", "location": "Australia", "race_fullname": "FORMULA 1 ROLEX AUSTRALIAN GRAND PRIX 2024"},
{"story_content": "Oscar Piastri took his first Grand Prix victory at the 35th attempt – but it was tense afternoon for the Australian as he waited for McLaren team mate Lando Norris to hand back the lead, which he'd lost as a result of pit stop strategy.While McLaren had their best result since Monza 2021, others left Budapest pondering what might have been. Lawrence Barretto picks out his winners and losers from an enthralling Hungarian Grand Prix...Oscar Piastri has had a few near misses of late – but he was not to be denied in Hungary as an excellent getaway to snatch the lead opened the gateway to secure his first Grand Prix win.The Australian, 23, is the first race winner born in the 21st century, the fifth Australian to stand on F1’s top step and the 115th driver to win a World Championship Grand Prix.READ MORE: Piastri admits McLaren team orders made him ‘a bit nervous’ as he reflects on ‘very special’ maiden win in HungaryThis was his third podium in six races and second top-two Grand Prix finish in the last three events. He’s now just five points behind Carlos Sainz in the fight for P4 in the drivers’ standings."},
{"story_content": "Daniel Ricciardo could not hide his frustration after an RB strategy call backfired in the Hungarian Grand Prix, resulting in the Australian dropping down the order and out of the points.The race had looked to hold some promise for Ricciardo after qualifying, where he secured a grid slot of P9. However, after slipping backwards at the start come Sunday, the 35-year-old was then brought in for an early pit stop to swap from his medium tyres to new hards.READ MORE: Piastri wins Hungarian Grand Prix as Norris belatedly hands back lead in McLaren intra-team dramaThis resulted in Ricciardo emerging back out into traffic – amid several cars that had pitted for softs – and from there he struggled to make much ground before ultimately crossing the line in P12.When asked about the idea that pitting so early could potentially undo his race, Ricciardo responded: “You wondered right, I thought the same thing honestly as soon as I… you don’t want to pull into the pits – you get the call and you know this isn’t the thing to do.“But you get the call late and there’s no time to question it, because then if you miss a lap, it’s even worse. But as soon as I pulled in, the cars on softs had pulled in, I was on a medium – [we should have thought] let’s go, let’s use our clear air we’ve got."},
{"story_content": "Toto Wolff says Mercedes are hoping for a return to cooler temperatures next weekend in Belgium after Mercedes’ two-race winning streak came to an end in the heat of Hungary.With the warm conditions not favouring the W15 as much as cooler climes, the Silver Arrows were not quite able to match the pace they displayed during their victorious weekends in Austria and at Silverstone.READ MORE: Hamilton thrilled with podium in Hungary after ‘very tough’ race as he reflects on ‘hair-raising’ battle with VerstappenHowever, Hamilton got the most out of his afternoon at the Hungaroring, a track that he has won at a record eight times. Despite struggling to make his tyres last during the final stint – as well as facing a feisty scrap with Max Verstappen for P3 along the way – the Briton held on to take the third spot on the podium behind winner Oscar Piastri and Lando Norris.Hamilton's team mate George Russell, meanwhile, started from down in P17 after errors from himself and Mercedes during qualifying, leaving him with work to do on race day. The 26-year-old had a long first stint before being undercut by the Red Bull of Sergio Perez during the second stops, giving him a final position of eighth."},
{"story_content": "Max Verstappen was outspoken throughout the Hungarian Grand Prix in Budapest, voicing his opinions on the team’s chosen strategy, his car's performance and his rivals' driving.It led to some eyebrow raising radio exchanges between the Dutchman and his Race Engineer Gianpiero Lambiase – but Team Principal Christian Horner was swift to dispel any rumours of a rift when he spoke to the media after the Grand Prix.Verstappen's frustrations began at the very first corner of the opening lap when he felt he was pushed wide by Lando Norris. But running second, the team asked him to give the place back to the McLaren man or risk face a penalty.He was then undercut twice by Lewis Hamilton’s Mercedes on a day where the undercut was powerful and track position was king, before late contact between the pair dropped the Dutchman from fourth to fifth at the flag.READ MORE: Piastri admits McLaren team orders made him ‘a bit nervous’ as he reflects on ‘very special’ maiden win in HungaryBut speaking after the race Horner insisted he had no concerns about his driver's approach to the race, or to team communications."},
{"story_content": "Oscar Piastri is now officially a Grand Prix winner, having taken victory in the Hungary on his 35th race start. But while he may still be relatively new to Formula 1, the Australian has been impressing across the motorsport ranks from an early age.After starting his karting career back home, Piastri faced the daunting step of moving to Europe aged just 14 to pursue his racing career in England. From there the teenager flourished, clinching victory in his debut Formula 4 race at Brands Hatch.READ MORE: Piastri admits McLaren team orders made him ‘a bit nervous’ as he reflects on ‘very special’ maiden win in HungaryMore success followed, with Piastri claiming consecutive championship titles in Formula Renault Eurocup, Formula 3 and Formula 2 in 2019, 2020 and 2021 respectively, before an infamous battle for his F1 services played out between Alpine and McLaren.It was the latter for whom the young hopeful eventually made his Formula 1 debut in 2023. And while many might have struggled with the pressure in such a situation, Piastri displayed a cool and calm demeanour as he continued to impress at the Woking squad.Hit play on the video above to watch how Piastri’s journey to becoming an F1 race winner unfolded."},
{"race_round": "ROUND 4", "race_url": "https://www.formula1.com/en/racing/2024/japan", "race_date": "05-07 APR", "location": "Japan", "race_fullname": "FORMULA 1 MSC CRUISES JAPANESE GRAND PRIX 2024"},
{"race_round": "ROUND 5", "race_url": "https://www.formula1.com/en/racing/2024/china", "race_date": "19-21 APR", "location": "China", "race_fullname": "FORMULA 1 LENOVO CHINESE GRAND PRIX 2024"},
{"race_round": "ROUND 6", "race_url": "https://www.formula1.com/en/racing/2024/miami", "race_date": "03-05 MAY", "location": "Miami", "race_fullname": "FORMULA 1 CRYPTO.COM MIAMI GRAND PRIX 2024"},
{"race_round": "ROUND 7", "race_url": "https://www.formula1.com/en/racing/2024/emiliaromagna", "race_date": "17-19 MAY", "location": "Emilia-Romagna", "race_fullname": "FORMULA 1 MSC CRUISES GRAN PREMIO DEL MADE IN ITALY E DELL'EMILIA-ROMAGNA 2024"},
{"race_round": "ROUND 8", "race_url": "https://www.formula1.com/en/racing/2024/monaco", "race_date": "24-26 MAY", "location": "Monaco", "race_fullname": "FORMULA 1 GRAND PRIX DE MONACO 2024"},
{"race_round": "ROUND 9", "race_url": "https://www.formula1.com/en/racing/2024/canada", "race_date": "07-09 JUN", "location": "Canada", "race_fullname": "FORMULA 1 AWS GRAND PRIX DU CANADA 2024"},
{"race_round": "ROUND 10", "race_url": "https://www.formula1.com/en/racing/2024/spain", "race_date": "21-23 JUN", "location": "Spain", "race_fullname": "FORMULA 1 ARAMCO GRAN PREMIO DE ESPAÑA 2024"},
{"race_round": "ROUND 11", "race_url": "https://www.formula1.com/en/racing/2024/austria", "race_date": "28-30 JUN", "location": "Austria", "race_fullname": "FORMULA 1 QATAR AIRWAYS AUSTRIAN GRAND PRIX 2024"},
{"race_round": "ROUND 12", "race_url": "https://www.formula1.com/en/racing/2024/great-britain", "race_date": "05-07 JUL", "location": "Great Britain", "race_fullname": "FORMULA 1 QATAR AIRWAYS BRITISH GRAND PRIX 2024"},
{"race_round": "ROUND 13", "race_url": "https://www.formula1.com/en/racing/2024/hungary", "race_date": "19-21 JUL", "location": "Hungary", "race_fullname": "FORMULA 1 HUNGARIAN GRAND PRIX 2024"},
{"race_round": "ROUND 14 - UP NEXT", "race_url": "https://www.formula1.com/en/racing/2024/belgium", "race_date": "26-28 26-28", "location": "Belgium", "race_fullname": "FORMULA 1 ROLEX BELGIAN GRAND PRIX 2024"},
{"race_round": "ROUND 15", "race_url": "https://www.formula1.com/en/racing/2024/netherlands", "race_date": "23-25 23-25", "location": "Netherlands", "race_fullname": "FORMULA 1 HEINEKEN DUTCH GRAND PRIX 2024"},
{"race_round": "ROUND 16", "race_url": "https://www.formula1.com/en/racing/2024/italy", "race_date": "30-01 30-01", "location": "Italy", "race_fullname": "FORMULA 1 PIRELLI GRAN PREMIO D’ITALIA 2024"},
{"race_round": "ROUND 17", "race_url": "https://www.formula1.com/en/racing/2024/azerbaijan", "race_date": "13-15 13-15", "location": "Azerbaijan", "race_fullname": "FORMULA 1 QATAR AIRWAYS AZERBAIJAN GRAND PRIX 2024"},
{"race_round": "ROUND 18", "race_url": "https://www.formula1.com/en/racing/2024/singapore", "race_date": "20-22 20-22", "location": "Singapore", "race_fullname": "FORMULA 1 SINGAPORE AIRLINES SINGAPORE GRAND PRIX 2024"},
{"race_round": "ROUND 19", "race_url": "https://www.formula1.com/en/racing/2024/united-states", "race_date": "18-20 18-20", "location": "United States", "race_fullname": "FORMULA 1 PIRELLI UNITED STATES GRAND PRIX 2024"},
{"race_round": "ROUND 20", "race_url": "https://www.formula1.com/en/racing/2024/mexico", "race_date": "25-27 25-27", "location": "Mexico", "race_fullname": "FORMULA 1 GRAN PREMIO DE LA CIUDAD DE MÉXICO 2024"},
{"race_round": "ROUND 21", "race_url": "https://www.formula1.com/en/racing/2024/brazil", "race_date": "01-03 01-03", "location": "Brazil", "race_fullname": "FORMULA 1 LENOVO GRANDE PRÊMIO DE SÃO PAULO 2024"},
{"race_round": "ROUND 22", "race_url": "https://www.formula1.com/en/racing/2024/las-vegas", "race_date": "21-23 21-23", "location": "Las Vegas", "race_fullname": "FORMULA 1 HEINEKEN SILVER LAS VEGAS GRAND PRIX 2024"},
{"race_round": "ROUND 23", "race_url": "https://www.formula1.com/en/racing/2024/qatar", "race_date": "29-01 29-01", "location": "Qatar", "race_fullname": "FORMULA 1 QATAR AIRWAYS QATAR GRAND PRIX 2024"},
{"race_round": "ROUND 24", "race_url": "https://www.formula1.com/en/racing/2024/united-arab-emirates", "race_date": "06-08 06-08", "location": "Abu Dhabi", "race_fullname": "FORMULA 1 ETIHAD AIRWAYS ABU DHABI GRAND PRIX 2024"}
]