{"story_name": "PIRELLI STRATEGY GUIDE: What are the pit stop and tyre options for the drivers in the Belgian Grand Prix?", "story_url": "https://www.formula1.com/en/latest/article/pirelli-strategy-guide-what-are-the-pit-stop-and-tyre-options-for-the.UKnA0TmfI2BdyqXFi5KRk"}
{"story_name": "TREMAYNE: ‘I really cried today’ – The day Schumacher soared at Spa and sealed the first of his 91 F1 wins", "story_url": "https://www.formula1.com/en/latest/article/tremayne-i-really-cried-today-the-day-schumacher-soared-at-spa-and-sealed.1zzLw6IDZqfatUkCtkk8Wz"}
{"story_name": "Leclerc vs Perez, and Verstappen’s charge from P11 – What To Watch For in the Belgian Grand Prix", "story_url": "https://www.formula1.com/en/latest/article/leclerc-vs-perez-and-verstappens-charge-from-p11-what-to-watch-for-in-the.aWTdIwK7CyQebJc8TUJym"}
{"story_name": "Leclerc ‘definitely did not expect’ Spa qualifying result after going second quickest and inheriting P1", "story_url": "https://www.formula1.com/en/latest/article/leclerc-definitely-did-not-expect-spa-qualifying-result-after-going-second.20TFONMR7irOVglYcjUH9F"}
{"story_name": "HIGHLIGHTS: Watch the qualifying action from Spa as Verstappen goes fastest while Leclerc inherits pole", "story_url": "https://www.formula1.com/en/latest/article/highlights-watch-the-qualifying-action-from-spa-as-verstappen-goes-fastest.1UI9Q4xypJgDEvwzzziBka"}
{"story_content": "Spa-Francorchamps. Wonderful, mercurial Spa. Seemingly perpetually shrouded in mist, if the rain isn’t falling then the trees are steaming in the sun. Did ever anywhere so damp bring quite so much joy? We’re having a very traditional weekend with rain for qualifying and sunshine forecast for the race – but we have a distinctly non-traditional grid, headed by Charles Leclerc and Sergio Perez.Lurking behind them, we have Hungary’s dominant McLarens lining up P4 and P5, quietly confident in their dry track performance, and Max Verstappen, first in qualifying, relegated to P11 with an engine penalty, eager to move forward. Strap in, this one’s likely to be busy…"}
{"story_content": "Charles Leclerc was in high spirits after qualifying for the Belgian Grand Prix, with the Ferrari driver pulling a lap out of the bag to initially claim second on the grid – which becomes pole position due to Max Verstappen’s engine penalty.Leclerc produced a time of 1m 53.754s in a tricky, rain-hit session at Spa-Francorchamps to slot in behind the dominant Verstappen, but the Dutchman’s 10-place drop means it is the Monegasque who will start Sunday’s race from P1.READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from poleAsked to reflect on his session, and his promotion to pole-sitter, Leclerc commented: “It’s good. I mean I definitely did not expect that this weekend.“Obviously with the tricky conditions we could do something above our expectations – it’s a good day for the team. Now we need to focus on tomorrow and see what will happen whenever the rain is gone.”He continued: “I think without this rain probably P5 was the position we were fighting for with the Mercedes especially. Obviously with the rain it helped us a little bit, but I’m not going to complain."}
{"story_content": "From four different teams in the top four places to Max Verstappen fighting back through the field from a grid penalty; and from plenty of overtaking opportunities to a weather forecast you can never be certain of, here are five key aspects to monitor during Sunday’s race at Spa-Francorchamps…Given recent form and the way qualifying was panning out for a spell, to have a front row of Charles Leclerc and Sergio Perez was somewhat of a surprise. Leclerc will start from pole for the first time since Monaco, while Perez was last in the top two in China."}
{"story_content": "One year to the race after he had astonished the F1 fraternity in qualifying, only to burn his Jordan’s clutch out at the start, Michael Schumacher set himself on his record-smashing road at Spa-Francorchamps by becoming the first German driver since Jochen Mass back in 1975 to win a Grand Prix.What history doesn’t often recall is that, with only slightly better fortune, it could have been his Benetton team mate Martin Brundle who was being congratulated for breaking his duck."}
{"story_content": "Charles Leclerc inherited pole for the Belgian Grand Prix thanks to Max Verstappen – who was fastest in qualifying – taking a 10-place grid penalty for Sunday's race.The Red Bull man topped all three qualifying sessions in Spa but will start from 11th place, while Leclerc's last ditch lap of 1m 53.754s (0.595s behind Verstappen's fastest Q3 effort) was enough to see him start at the front of the grid.READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty as he heads Leclerc and PerezVerstappen's Red Bull team mate Sergio Perez will begin Sunday's Grand Prix in P2, a welcome return to form for the Mexican, while Lewis Hamilton will start P3.It was a change in fortunes for the McLaren duo of Lando Norris and Oscar Piastri who were fifth and sixth fastest respectively, meaning they will start the race from fourth and fifth.Click play on the video above to watch the highlights from a damp qualifying session in Spa."}
{"story_name": "Norris ‘expected worse’ in Spa qualifying after day of ‘not clicking’", "story_url": "https://www.formula1.com/en/latest/article/norris-expected-worse-in-spa-qualifying-after-day-of-not-clicking.1o85QiRibGjjfBXr8aSvNH"}
{"story_name": "RACE PREDICTOR: Who do you back for a podium finish at the Belgian Grand Prix?", "story_url": "https://www.formula1.com/en/latest/article/race-predictor-who-do-you-back-for-a-podium-finish-at-the-belgian-grand-prix.5SV25ax9IHhJaWrGVCqc4G"}
{"story_name": "FIA post-qualifying press conference – Belgium", "story_url": "https://www.formula1.com/en/latest/article/fia-post-qualifying-press-conference-belgium-2024.5MVb69g5WOubQ3UcLxD1g5"}
{"story_name": "Leclerc ‘definitely did not expect’ Spa qualifying result after going second quickest and inheriting P1", "story_url": "https://www.formula1.com/en/latest/article/leclerc-definitely-did-not-expect-spa-qualifying-result-after-going-second.20TFONMR7irOVglYcjUH9F"}
{"story_name": "Verstappen expecting ‘tough battle’ from P11 in Belgium while Perez targets victory", "story_url": "https://www.formula1.com/en/latest/article/verstappen-expecting-tough-battle-from-p11-in-belgium-while-perez-targets.5v1zTCefmNCwfx4AofJ7Rv"}
{"story_name": "WATCH: Ride onboard for Verstappen's fastest lap from qualifying in Spa", "story_url": "https://www.formula1.com/en/latest/article/watch-ride-onboard-for-verstappens-fastest-lap-from-qualifying-in-spa.5V8tOO9BbzbOZylQHXsooc"}
{"story_name": "FACTS AND STATS: Perez bags first front row start since China after scraping into Q3 by 0.003s", "story_url": "https://www.formula1.com/en/latest/article/facts-and-stats-perez-bags-first-front-row-start-since-china-after-scraping.47cLWlzCEBXSMFurba06KD"}
{"story_name": "HIGHLIGHTS: Watch the qualifying action from Spa as Verstappen goes fastest while Leclerc inherits pole", "story_url": "https://www.formula1.com/en/latest/article/highlights-watch-the-qualifying-action-from-spa-as-verstappen-goes-fastest.1UI9Q4xypJgDEvwzzziBka"}
{"story_name": "Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole", "story_url": "https://www.formula1.com/en/latest/article/verstappen-claims-p1-in-belgium-qualifying-ahead-of-grid-penalty-as-he-heads.4G7gZvZk3905EWPcv7fdNc"}
{"story_content": "RACE 02 14 28 NEWS Qualifying day brought mixed feelings for McLaren in Belgium, with Lando Norris and Oscar Piastri claiming P5 and P6 – which will become P4 and P5 after Max Verstappen’s 10-place grid drop – despite showing strong pace on Friday. With the session taking place on a damp track after heavy rainfall earlier on at Spa-Francorchamps, the drivers were faced with tricky conditions as the session played out. Given that, Norris was left satisfied with his end result, having also felt that he had not been driving at his best. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole “[It was] tough, but I’m honestly pretty happy with today,” the Briton said after the session. “I think, in the end, me and Oscar were split by half a tenth or something. “Clearly we were lacking comparing to the cars ahead – especially the Red Bull, the Red Bull’s another level comparing to us in the rain and even in the dry they were probably still a bit stronger. “A tough day, I expected worse and I’ve not been driving particularly well, just one of those days where it’s not clicking. Kind of similar to yesterday honestly, so just a little bit of a struggle for me, so to start with P5 I was pretty happy with.”     Norris ‘pretty happy to salvage P5’ after day when his driving ‘wasn’t clicking’ Pushed on whether he could still be in a good position to fight for a win on race day, Norris responded: “I mean we’re in a good spot, but we have a Red Bull on pole still and they’re clearly the quickest. “It’ll be tough, Max is going to come through I think pretty quickly still and most likely going to be fighting him for the win. But I’m hoping that maybe with a slightly lower downforce setting that we chose today comes back into our favour tomorrow.” HIGHLIGHTS: Watch the qualifying action from Spa as Verstappen goes fastest while Leclerc inherits pole Piastri echoed Norris’ thoughts on the challenging session, with the Australian admitting that it had been “difficult”. “I think our pace looked reasonable at times, or looked quite good at times I’d say,” he explained. “I think in Q3 maybe we got the tyre strategy a little bit wrong, but I think it’s so hard to predict. “It’s still raining now and not really making anything wetter, so it’s just very difficult to predict how much it’s going to rain, how much it’s going to affect you, and we did the safe thing. In the end maybe it wasn’t quite the right move, but still not a bad effort.     Piastri insists ‘we can still fight for the win’ despite missing out on top grid spot “We still got two cars through into what will be the top five tomorrow, and I think Spa is definitely a track where you can overtake and make progress. Our dry pace looked competitive and I think we can hopefully show that tomorrow.” Piastri also acknowledged that suffering a slight moment in the session may have compromised him slightly, having commented: “Yeah, it hurt me a bit. I think the first lap was really the lap where you needed to nail it on the new tyres and, yeah, just a couple of small mistakes really. FACTS AND STATS: Perez bags first front row start since China after scraping into Q3 by 0.003s “Of course it’s very difficult in these conditions to get everything right but, yeah, probably cost me a couple of positions.” One week on from his debut F1 Grand Prix victory in Hungary, Piastri is hopeful of being in a position to repeat the feat in Belgium. “I think we can still fight for the win tomorrow,” the 23-year-old remarked. “I think our pace was very strong yesterday in the dry, and I think it’s looking like a dry race tomorrow. Obviously starting a little bit further back makes life a bit more tricky but, no, still think we’re in decent shape to fight a win.” © 2003-2024 Formula One World Championship Limited"}
{"story_name": "AS IT HAPPENED: Follow all the action from qualifying for the Belgian Grand Prix", "story_url": "https://www.formula1.com/en/latest/article/live-coverage-qualifying-in-belgium-2024.1lj1B5akozs2zLhhlydCXn"}
{"story_content": "RACE 02 14 14 POLL While Max Verstappen was fastest in qualifying, it is Ferrari's Charles Leclerc who will start Sunday's Belgian Grand Prix from pole position. Instead, the Red Bull man faces a fightback from 11th thanks to his 10-place grid penalty for taking on a fifth ICE of the year. However, on today's evidence can the reigning world champion be in contention for a podium finish or even a win? The Dutchman has never won from P11 on the grid in his career – but he has won from a record-equalling nine different grid positions. If anyone can do it, he can. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole Sergio Perez will also fancy his chances for victory in Spa, with a bounce back in form seeing him start alongside Leclerc on the front of the grid, while the McLarens of Lando Norris and Oscar Piastri will hope to capitalise after their one-two in Hungary – they will be starting fourth and fifth respectively. Don't rule out the Mercedes duo of Lewis Hamilton and George Russell either, lining up in third and sixth on Sunday, while Sainz will hope to join his team mate Leclerc in figthing at the front. How do you think the Grand Prix will pan out? You can get involved and predict the top three finishers in Belgium using our predictor below. Get voting now! © 2003-2024 Formula One World Championship Limited"}
{"story_name": "HIGHLIGHTS: Catch up on a wet FP3 in Belgium as Verstappen goes fastest and Stroll brings out red flags", "story_url": "https://www.formula1.com/en/latest/article/highlights-catch-up-on-a-wet-fp3-in-belgium-as-verstappen-goes-fastest-and.13cRtUWwVyhHGKDmL0c3HV"}
{"story_name": "How teams manage the logistics of an action-packed F1 season around the world", "story_url": "https://www.formula1.com/en/latest/article/how-teams-manage-the-logistics-of-an-action-packed-f1-season-around-the.7ee8fPlml9D2V4G7c8KMkX"}
{"story_content": "RACE 02 13 51 NEWS Charles Leclerc was in high spirits after qualifying for the Belgian Grand Prix, with the Ferrari driver pulling a lap out of the bag to initially claim second on the grid – which becomes pole position due to Max Verstappen’s engine penalty. Leclerc produced a time of 1m 53.754s in a tricky, rain-hit session at Spa-Francorchamps to slot in behind the dominant Verstappen, but the Dutchman’s 10-place drop means it is the Monegasque who will start Sunday’s race from P1. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole Asked to reflect on his session, and his promotion to pole-sitter, Leclerc commented: “It’s good. I mean I definitely did not expect that this weekend. “Obviously with the tricky conditions we could do something above our expectations – it’s a good day for the team. Now we need to focus on tomorrow and see what will happen whenever the rain is gone.” He continued: “I think without this rain probably P5 was the position we were fighting for with the Mercedes especially. Obviously with the rain it helped us a little bit, but I’m not going to complain.     Qualifying Highlights: 2024 Belgian Grand Prix “I’m really happy… I’m very happy with the lap in Q3 and it’s good to be back on the front part of the grid, but now we’ve got to finalise that tomorrow.” Leclerc’s first challenge on Sunday will be trying to keep hold of P1 on the opening lap, with Spa offering cars behind an opportunity to slipstream on the run to Eau Rouge and pull off an overtake along the Kemmel Straight. FACTS AND STATS: Perez bags first front row start since China after scraping into Q3 by 0.003s ”It’s not the easiest first place to keep on the first lap here, but honestly I will see,” he said. “Every start is different and once I’ll be in the car tomorrow through Eau Rouge I’ll decide what’s the best thing I can do, but obviously I’ll try to keep that first place.” On the other side of the Ferrari garage, it was not such a competitive Q3 phase for Carlos Sainz, who had to settle for P8, which becomes P7 after Verstappen’s penalty. “Everything felt pretty straightforward for me,” began the Spaniard. “I was quite happy with the car in the Q1 and Q2, and even in Q3 I felt like I was driving well in the wet and putting together some strong laps and quick all-round. Verstappen’s grid penalty promotes Leclerc to P1, while Sainz moves up from P8 to P7 “Just the last set [of tyres in] Q3 for some reason was a bit of a disaster for me. I didn’t find the grip that I had all session and I was really struggling with the tyres, with the warm-up, and I had absolutely zero grip. “It’s something to look into, to analyse, see what we could have done better, but time to quickly switch the page because tomorrow is a new day and it’s race day.” AS IT HAPPENED: Follow all the action from qualifying for the Belgian Grand Prix With dry weather conditions expected to return tomorrow, Sainz added: “I think we have a chance to be in a position to move forward through the field. “At the same time, in front of me there are cars with very similar pace, or some of them even quicker than us. It will be difficult to move forward, but we’ll give it our best chance with strategy and managing the race.” © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 13 39 NEWS 1. Max Verstappen (Red Bull), 2. Charles Leclerc (Ferrari), 3. Sergio Perez (Red Bull) TRACK INTERVIEWS (Conducted by Billy Monger) Q: Checo Pérez, a good qualifying for you there. P3, but you will line up second on the grid for tomorrow's race with your team-mate's penalty. How was it out there for you? Sergio PÉREZ: Yeah, it was very tricky at times. Obviously, as always, you know, in these conditions, it's so easy for it to go wrong, as it's been going in the last few qualifyings in these conditions. And, yeah, I mean, it was good to finally put it together. Unfortunately, we didn't have any new tyres for Q3. We were a bit out of sync in Q2, so we were also quite lucky to make it in P10. And I think P2 is probably the best position you can wish for in Spa, you know. It was the same with Charles last year, so I'm going to be trying tomorrow to be the same. And, yeah, it's a long race ahead of us. It looks like it's going to be dry, so we'll see. Q: And going into the race tomorrow, obviously qualifying has been a part of your season that has been under pressure, especially the last few races, it hasn't gone to plan. What was your mindset going into this weekend, knowing that Spa is a circuit that in previous years has suited your car pretty well? SP: Yeah, you know, I mean, like I've always said, you know, every weekend it's a new opportunity to do better, every day, you know. Tomorrow is a new opportunity for us to do even better than today and go for that win. Q: And that opportunity… You mentioned the race tomorrow. You will be starting on the front row. What can you do tomorrow, Sergio? Are you capable of winning this race? SP: We'll see, you know, it's a very long race ahead of us. I think tomorrow degradation will be quite tricky, and graining with this new tarmac. I think there are a lot of unknowns still, but I’ve got a good feeling for tomorrow, so we'll see. Q: Congratulations. Good luck tomorrow, Sergio. Charles Leclerc, second in qualifying today, but you will line up on pole position tomorrow. Pretty similar to last year in that regard. Charles LECLERC: Yeah, I mean, exactly the same. It's good. I mean, I definitely did not expect that this weekend. Obviously, with the tricky conditions, we could do something above our expectations. So, yeah, it's a good day for the team. Now we need to focus on tomorrow and see what will happen whenever the rain is gone. Q: So do you think the conditions today, the fact we had the mixed conditions out there – and it looked tricky from the driver's point of view – do you think that helped you make the difference today? CL: Yeah, I think that without this rain, probably P5 was the position we were fighting for, with the Mercedes especially. But obviously with the rain, it helped us a little bit. But I'm not going to complain. I'm really happy. I'm very happy with the lap in Q3. And it's good to be back on the front part of the grid. But now we've got to finalise that tomorrow. Q: And tomorrow you'll be starting from pole. What's your approach going to be going up through Eau Rouge on that first lap if you're still in the lead? Because it could be a tricky race to lead the first lap around here. CL: Yeah, it's not the easiest first place to keep on the first lap here. But honestly, I will see it. Every start is different. And then once I'll be in the car tomorrow through Eau Rouge, I'll decide what's the best thing I can do. But obviously, I'll try to keep that first place. Q: Good luck for tomorrow. CL: Thank you very much. Thank you. Q: Max Verstappen, another pole position for you this weekend. Unfortunately, you won't line up in pole position because of the grid penalty. But talk us through that lap because that was exceptional out there. Max VERSTAPPEN: Yeah, it was a nice qualifying. Luckily, the weather was okay. It was just raining a little bit, but at least we could do a decent qualifying. Yeah, everything worked well. Every tyre set that we were on, we could just do good lap times. I was, of course, also thinking about Q3, not knowing if it was going to dry out, so I was trying to keep two new sets for Q3, and luckily we escaped in Q1, Q2, so... Yeah, very happy. I mean, the car was working quite well in the wet. Yeah, I could just do my laps and try to do clean lap times in the wet, which is always quite tricky. But tomorrow, of course, I know that it's quite a different day. It's going to be warmer, normally no rain. So it's all about tyre degradation. And, yeah, we just need to make sure we're good on that. I know that, of course, I have to start also ten places back, so this was the best I could do today. And then go from there. I don't know how quick we're going to be. I hope that we can be in the mix, you know, to try and move forward. Q: Coming into this weekend, you probably knew within the team that you were going to take this grid penalty and make the decision that you have. You've started out of position here in Spa. What's your approach going to be down into Turn 1? Because it's a tight corner. It can really get a bit chaotic at times there. MV: Yeah, the race can be lost, of course, in Turn 1, so just need to see what happens, you know, in the start, naturally, and just go from there. It's a very long race, it's very hard on tyres, and just need to try and manage that as good as we can, and hopefully then we can be competitive tomorrow. Q: It's been a couple of races since you've won a Grand Prix. Starting where you are tomorrow, do you think you can bounce back after last weekend and get a race victory? How quick is your car in race trim? MV: We are not making it easy on ourselves, and especially, of course, in the battle that we're in. I know that today was a great day, but it's in the wet. We need to be quick in the drive tomorrow. But yeah, it's going to be a tough battle. Yeah, we'll try to do the best we can. Hopefully, we can battle the Ferraris and the Mercedes, of course, ahead. And if we have a bit of luck, of course, maybe we can challenge the McLaren. PRESS CONFERENCE Q: A very warm welcome to the fastest three drivers in qualifying for the FIA Formula 1 Belgian Grand Prix. In third place, Sergio Pérez. In second place, Charles Leclerc. And fastest in Q3 once again here at Spa, Max Verstappen. Well, very well done, Max. You were extremely quick in all conditions. How hooked up were you and the RB20 today? MV: Yeah, it was a good day. Of course, yesterday we tried a few things with the car. I think we learned from that. And today we tried to put on the car what we thought was best. And I think, as you could see, we ran maybe also a little bit more downforce compared to some competitors. So naturally, of course, in the wet, probably it's a little bit more stable and that can help, of course, around here. But overall, I think the laps were good in qualifying all the way from Q1 to Q3. I passed Q1 and Q2 only on one tyre set, so I think that was important because that gave me, of course, a better opportunity for Q3. Yeah, everything was working well, but, of course, today is not as important because tomorrow is going to be dry, it's going to be warmer, and we need to be good on tyres and, of course, starting 10 places back. It is going to be, of course, a little bit more tricky. I don't expect it, of course, to be like the last two years. Naturally, looking at the cars around us being quite quick. So, yeah, we'll just try to move forward, try to fight Ferraris, Mercedes, and with a bit of luck, maybe the McLarens, but it all depends on our pace ourselves. Q: Max, one question about Q3. You were six tenths faster than anybody else after the first runs. Why did you go out again? Was it just to be sure? MV: I had another tyre set, so I was like, let's try and go faster. I'm not sure what happened. I was very close to my lap time in places, like gaining, losing. Maybe it just rained a little bit more and it just didn't give me the same grip. But I mean, both laps are almost identical. So when you have the tyres, I mean, you can try and get a better lap out of it. Q: You've said who you hope to be battling with in the race tomorrow. Just strategically, what is going to be your approach? MV: Survive lap one and just go from there. I mean, we also have a bit of a different tyre strategy to the other cars, so we have to wait and see how that will evolve in the race. But, yeah, we'll see what we can do. I mean, I'm not as confident as I was the last two years around here in coming back to the front. I still see it more as a damage limitation race. That's how it is. But at least today was the best possible we could do in terms of the starting position for tomorrow. Q: Are you more confident in the car here than you were at the Hungaroring last weekend? MV: I think overall the balance is a bit better, yeah. If it's going to be enough to be the quickest, I'm not sure. But yeah, hopefully we can just have it all a bit more under control. Q: Alright, very well done today. Charles, let's come to you now, tomorrow's pole sitter. But let's talk about Q3. You pulled together a beautiful lap right at the end of the session. Just how good was it? CL: It was a good lap. As Max said, the rain picked up a little bit at the end of Q3, which maybe there was a bit more to find on the first part of Q3, but obviously anyway, P1 was out of reach for us today. It's a lot better than what we expected coming into the weekend, and especially after yesterday, that was a very difficult day for the team once again. So yeah, the tricky conditions helped us today. Q: What about the asphalt? So much of it is new this year. How was that performing in the wet weather? CL: I mean, the old asphalt seems to be drying up pretty quickly, whereas the new asphalt a little bit slower. So that was a little bit tricky. But all in all, it was fine. I think there was quite a good grip on the new asphalt, which made it quite fun to drive in wet conditions. Q: So, Charles, let's throw it forward. Pole position. Are you more confident coming into this race than you were at the same point last year? CL: I cannot remember about last year. Too long ago, and so many things have happened since then. Then for sure, if we are looking for tomorrow, it's going to be a tricky race for us. It will be dry conditions. And on dry conditions recently, we've been struggling a little bit more. However, the McLaren is a bit further away than what we wanted. There's Checo right behind. That will be the main target, and then we'll see how it goes after the first stint. But it's a good starting position. It's also a track where you can overtake quite easily, so we'll need the pace, and that we’ll only have the answer tomorrow. 1 / 5 Q: Very well done. Thank you. And Checo, well done to you as well. That was a great qualifying session for you. Are you much happier with the car this weekend? SP: Not initially. We tried a lot of things. We kept throwing things at it. And it's never ideal when you don't have progression. And once again, today we threw at it a lot of things. I think we found a nicer window, a little bit similar in the direction of Hungary. But we were a lot happier with the car, so I think… Although, I mean it's on Inter conditions but the balance in the medium high-speed was feeling positive, in the right direction. So let's see tomorrow. I think tomorrow is going to be a very different day and let's see where how much we are able to improve. Q: Given that you only just crept through Q2 were you surprised by your pace in Q3? SP: I think already I was quick in Q1, Q2. The problem was our run programme. We finished a lap before everyone. I think I was P4 or something. But then, you know, when you give a lap away, everything was really, really close. So we were very lucky to be able to make it. I think it was, yeah, it was definitely a mistake on our run programme to left us vulnerable, basically. Q: Alright, and just your thoughts on the performance of the car in the dry? SP: I think yesterday McLaren looked very strong. But at the same time, we are not that far away. So we've done some changes in the direction of tomorrow. So we'll see. I think after the first stint, we will have a good idea. QUESTIONS FROM THE FLOOR Q (Christian Menath – Motorsport-magazin.com) I think you went for the bigger rear wing as the one you had in FP1. Some people might think it's a strange choice given that you have the 10-place grid penalty, but is it the case that with the DRS effect so big nowadays that it doesn't make a huge difference in the race then? MV: I felt a bit more confident and comfortable on the FP1 wing. So I hope that that is also going to be the case tomorrow. Tomorrow is a bit warmer as well, so naturally probably a bit more sliding. I just hope, yeah, that it's better for me. But when you look at the McLaren, for example, they run a very skinny wing. Seems to work for them, but it didn't really work for me yesterday. So yeah, bit of a different strategy also there. And I guess we'll find out tomorrow how it will work out. I mean, I have to pass cars. The DRS effect is quite big around here, but at the end of the day, I think it's more important just to be good on tyres around here. Because if you're good on tyres, you can pass people. Q: (Scott Mitchell-Malm – The Race) Checo, after the last couple of months, I think this is your best qualifying result since China. How kind of satisfying is that for you, given the criticism that you've had, the fact that Red Bull has said that they wanted to have some conversations over the summer break? It's perfectly timed. And I think, as Tom alluded to, it could have been so different had that run plan cost you in Q2. SP: From my point of view, it doesn't change anything. You know, I've always said it's not where we are now, it's how you ride the waves and where we finish in Abu Dhabi. I mean, there are a lot of drivers that haven't been able to maximise their performance lately, but obviously, the scrutiny on my side has been quite a bit higher. It doesn't change anything from my point of view. I think tomorrow is a new day, a new opportunity. It would have been the same if I was knocked out in Q2. Tomorrow is a new opportunity to do better. And it's the way I see it. It's tomorrow what really counts. And if I don't have a good race tomorrow, I will try to have a good one in Zandvoort. It's how it is, this is a sport and sometimes it goes your way, sometimes you have to fight and nothing goes in your direction, but I think it's just the nature of the sport. Q: (Jake Boxall-Legge – Autosport) Another question for Checo. Obviously, fantastic result today, really good race in Hungary as well. Do you feel like confidence is starting to come back to you after, I guess, a very difficult period for you? SP: More than confidence, I mean, it's not like I forgot how to drive, you know, from five, six races ago. It's just that you see it with a lot of drivers. Sometimes you're not able to maximise the full potential of your car. And for that reason, you end up lacking that, let's say, confidence to extract the maximum out of the car you have. I think we've been taking good step forwards in the right direction since Hungary. I think Silverstone was already quite good, I had a really good Friday. So I think the season… The car is going in the right direction for now and hopefully tomorrow we are able to finish it off with a strong result. And still, there is a long way to go in the season. So yeah, just head down and I think like I've said before, you know, the team and myself are focusing on and what we’ve got to do. At the end of the day it's getting the most points we possibly can and the rest couldn't care less to be honest. Q: (Carlo Platella – FormulaPassion.it) A question for Max and Sergio. How much do you think today result is due to track, weather conditions or a different set-up strategy? MV: I think it's all down to the drivers! SP: Confidence. MV: No, well, like I mentioned before, we run a bit more downforce, so for sure that is good for today. One lap pace is of course important, but it's more important to be good on the tyres tomorrow. I feel like most of the last qualifyings, we have been quite close over one lap, even when I was still not entirely happy with the car or the balance. But then in the race, sometimes there have been bigger differences for me. So it's important that tomorrow we are good on tyres and competitive, of course, as well. SP: Same. Q: (Luke Smith – The Athletic) Max, I know you said it's still a damage limitation race for you, but compared to Thursday when you seemed quite downbeat about your chances of winning, given where the McLarens are starting as well tomorrow, do you feel a little bit more optimistic that you could still win tomorrow's race? MV: Looking at their pace yesterday in the long run, it's incredibly strong. They look very comfortable out there. Of course, they are starting a little bit further back, I think they're so fast they will quite quickly challenge for the front, for the lead. And it also depends a bit, of course, how I get through lap one and stuff. But I would already be happy if we can match that race pace. So starting a bit further back, also being on different tyres, I don't know how that is going to work out. Most teams around us have two hard tyres, we don't. I don't know if that's better or not, of course, for the moment, but we'll find out tomorrow. But, yeah. It's definitely still a damage limitation. Q: (Leonardo Pasqual – Funoanalisitecnica.com) Charles, how did you improve the balance of your car from Q1 to Q3? And how did you work to put more temperature on the tyres? CL: We didn't change the balance that much actually from Q1 to Q3. I think where we improved quite a bit was to put the tyres in the right window. That was super important and in those conditions that's always where you struggle. So this we did some modifications especially on the out lap and how much you push and where you push. And then I felt more at ease, and that helped me for Q3. So, yeah, it was all about fine-tuning the out lap and putting the tyres in the right window. Q: (Lawrence Edmondson – ESPN) Another question for Charles. How surprised are you by this result? Because obviously it's been a while since we've seen you in the top three. Was it just a case of, like you say, getting the tyres in the right window in the wet, or is this something of a bigger step for Ferrari? CL: No, I'm very surprised. And actually, even when I finished the lap, I didn't feel like it was worth a second place. I mean, it was a good lap, a clean lap, and that's what you need in those conditions. And I believe that especially when you get to Q3 in the last lap, everybody knows that this is the lap, and that pushes people to maybe do more mistakes. On my side, it was a clean lap, but not an incredible lap. So yeah, I'm very happy to be P2 but I definitely did not expect that. I think as a team today P5 will have been a bit of a good result and today we are P2 and tomorrow we will be starting on pole. So that's a good thing. But as I said we don't have any magical solution for the race pace and it will be a bit of a tricky day tomorrow. Q: (Scott Mitchell-Malm – The Race) Do you think that when you look at the comparison of your car to McLaren, do you think that the McLaren is now the best all-round car, but it's now about optimising things, and actually they're so closely matched that conditions, track characteristics is the thing that will swing the battle between the two teams? MV: Well, I think if you look at the last five, six races, they for sure have been the best. I mean, quite clear. And I mean, that's fine. Fair play to them. I think they have done a great job. From our side, yeah, we have a bit of work to do, a few things also to analyse over the break. From race one all the way to here, what we have done. And then, yeah, try to fight back from Zandvoort, see if we can actually improve the situation, try to turn it around, try to be more competitive. I think the battle is in a way still quite tight. So, you know, when you make small mistakes, it definitely can swing quite quickly. And yeah, we have to try to use that in our advantage as well, because it's so difficult at the moment. But we'll see. I mean, there are so many races left and so many things that can happen. You can have the best possible preparation into every single weekend, but even then things can catch you by surprise. So you just have to remain focused, calm, and try to improve. SP: Yeah, I think they've been the best car, let's say, for the last five races or so in different types of circuits. They've been strong, certainly in the race pace, and I think the break comes at a good time for Red Bull because we've got a lot to analyse on our season, the directions we've been taking, and hopefully get the balance a little bit more together for the second half of the season. More than any other upgrade, I think getting the balance in the right window will be the main key and the main focus to see what we've done, the upgrades we have brought to see where exactly we are, because I feel like we've been a little bit lost lately. Q: (Carlo Platella – FormulaPassion.it) Charles, how was the situation with bouncing during the weekend? CL: Today, it was fine. But obviously, in wet conditions, it's always a little bit less of an issue. Yesterday, we struggled a bit more with it. But I don't expect this to be an issue tomorrow during the race. So this is a positive. So yeah. But if it was a dry quali, I would have expected it to be a bit more of a struggle for us. © 2003-2024 Formula One World Championship Limited"}
{"story_name": "Gasly pays tribute to ‘honest and transparent’ Famin as Alpine boss prepares to step back from F1 duties", "story_url": "https://www.formula1.com/en/latest/article/gasly-pays-tribute-to-honest-and-transparent-famin-as-alpine-boss-prepares.31yaC2ne908fSvrxbChSSp"}
{"story_content": "RACE 02 13 20 NEWS Max Verstappen is anticipating a “tough battle” ahead in the Belgian Grand Prix, despite the Dutchman going fastest in qualifying by half a second before being dropped down to P11 owing to an engine penalty. Verstappen went quickest during the first runs of Q3 on a time of 1m 53.159s, sixth tenths clear of Red Bull team mate Sergio Perez. The impressive lap went unbeaten and – while Charles Leclerc beat Perez into P2 – Verstappen remained in P1, a position he will not keep due to the 10-place grid drop. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole “That was a nice qualifying,” the reigning world champion commented afterwards. “Luckily the weather was okay – it was raining a little bit but at least we could do a decent qualifying. Everything worked well, every tyre set that we were on we could do good lap times. “I was also of course thinking about Q3 not knowing if it was going to dry out, so was trying to keep two new sets for Q3 and luckily we escaped Q1 and Q2 so, yeah, very happy. The car was working quite well in the wet, so I could just do my laps and try to do clean lap times in the wet, which is always quite tricky. “But tomorrow I know it’s going to be quite a different day. It’s going to be warmer, normally no rain, so it’s all about tyre degradation and we just need to make sure we’re good on that.     2024 Belgian GP Qualifying: Max Verstappen and Red Bull celebrate his P1 lap in Q3 “Of course I have to start 10 places back, so this is the best I could do today and then go from there. I don’t know how quick we’re going to be, I hope we can be in the mix to try and move forward.” Asked how he will approach Turn 1, Verstappen explained: “Races can be lost into Turn 1, so [we] need to see what happens in the start naturally and just go from there. It’s a very long race, it’s very hard on tyres and we just need to manage that as good as we can and hopefully then we can be competitive tomorrow.” HIGHLIGHTS: Watch the qualifying action from Spa as Verstappen goes fastest while Leclerc inherits pole The result comes after a tough weekend for Verstappen last time out in Hungary and, pushed on whether he can still bounce back from that this time around given his grid slot, the 26-year-old said: “We are not making it easy on ourselves and especially, of course, on the battle we’re in I know that today was a great day. “But it’s in the wet and we need to be quick in the dry tomorrow. It’s going to be a tough battle. We’ll try to do the best we can and hopefully we can battle the Ferraris and Mercedes ahead, and if we have a bit of luck maybe we can challenge the McLarens.” Verstappen’s penalty means that Perez will now start from the front row, with his third place in qualifying becoming second on the grid. It marked a better Saturday than the Mexican has experienced of late, yet he acknowledged that the damp weather had still made the session challenging. Perez will start from the front row for the first time since China “It was very tricky at times,” Perez reflected. “Obviously, in these conditions it’s so easy for it to go wrong – as it has been going in the last few qualifyings in these conditions. It was good to finally put it together. “Unfortunately we didn’t have any new tyres for Q3, we were a bit out of sync in Q2 so we were also quite lucky to make it in P10. I think P2 is probably the best position you can wish for in Spa. It was the same with Charles last year, so I’m going to try tomorrow for it to be the same. It’s a long race ahead of us, it looks like it’s going to be dry, so we’ll see.” FACTS AND STATS: Perez bags first front row start since China after scraping into Q3 by 0.003s While there has been pressure on Perez of late given his difficult run of weekends, the 34-year-old said that he has continued to remain optimistic about turning things around. “Like I’ve always said, every weekend it’s a new opportunity to do better every day,” he added. “Tomorrow is a new opportunity for us to do even better than today and go for that win.” In terms of what he can do on Sunday and if he could be in the fight for victory, Perez responded: “We’ll see. It’s a very long race ahead of us. I think tomorrow degradation will be quite tricky – graining with this new tarmac. I think there are a lot of unknowns still but I’ve got a good feeling for tomorrow, so we’ll see.” © 2003-2024 Formula One World Championship Limited"}
{"story_name": "FP3: Verstappen tops wet final practice at Spa-Francorchamps as Stroll crashes out", "story_url": "https://www.formula1.com/en/latest/article/fp3-verstappen-tops-wet-final-practice-at-spa-francorchamps-as-stroll.40DEehL89YKFaVN3nnkrIL"}
{"story_content": "RACE 02 13 04 VIDEO     Max Verstappen was the fastest man in Belgian Grand Prix qualifying but, owing to his 10-place grid penalty for the race, he will start from P11, while Ferrari's Charles Leclerc inherits pole. However, the Red Bull man will fancy his chances in Sunday's Grand Prix after looking impressively quick throughout each segment of qualifying in Spa – his lap of 1m 53.159s was a class above the rest. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty with Leclerc to start race from pole Click play on the video above to ride onboard with Verstappen as he sets the fastest lap at Spa, even though he didn't get the prize of a start from pole position. © 2003-2024 Formula One World Championship Limited"}
{"story_name": "WATCH: Heavy Stroll crash brings out the red flags in FP3 amid pouring rain", "story_url": "https://www.formula1.com/en/latest/article/watch-heavy-stroll-crash-brings-out-the-red-flags-in-fp3-amid-pouring-rain.4PetPvB0HD1l40sjrSkKzh"}
{"story_content": "RACE 02 12 48 FEATURE Virtual Statman Saturday was as wet as predicted in Spa, with the rain falling across final practice and intermittently throughout qualifying. Throughout it all emerged Max Verstappen with the fastest time, but the Dutchman won’t get to start on pole thanks to a grid penalty. That’s not the first time he’s ceded pole here to Charles Leclerc either, which is just one of a number of interesting facts and stats from Belgium… Verstappen was quickest in Q3 at Spa for the fourth consecutive year, but loses pole to a penalty for the third consecutive year. The Dutchman has never won from P11 on the grid in his career – but he has won from a record-equalling nine different grid positions. Verstappen’s margin to the field in Q3 in Belgium was 0.632s in 2022, 0.820s in 2023 and 0.595s in 2024. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty as he heads Leclerc and Perez Ferrari inherit pole from Verstappen at Spa for the third consecutive year, Leclerc for the second straight year. The pole-sitter has not won any of the last five races in 2024. Leclerc will start from his 25th career pole, and his second pole of the season. The last man to win from P1 this season was Leclerc himself, back in Monaco. Leclerc inherited pole thanks to Verstappen's grid penalty Sergio Perez starts second, having missed out on beating Leclerc by just 0.011s, but having only made Q3 by 0.003s. The Mexican starts second for the third consecutive year at Spa and has finished second here for the last two years. It’s Perez’s first top-seven start since Miami, eight races ago. Lewis Hamilton bagged his third top-three start of the season with P3 on the grid as he out-qualified his team mate in consecutive races for the first time this season. It’s the fourth straight year that Hamilton starts on the second row at this track. READ MORE: Gasly pays tribute to ‘honest and transparent’ Famin as Alpine boss prepares to step back from F1 duties Lando Norris starts fourth, his highest career start at Spa, but lowest start this season since Monaco, six races ago. Oscar Piastri will start from P5, the same slot as last year where he crashed out on the opening lap. George Russell grabbed sixth, and still leads Hamilton 10-4 in their qualifying head-to-head this year. Albon will start in the top 10 tomorrow, after an impressive qualifying performance Carlos Sainz starts seventh, having been out-qualified by Leclerc for the first time in four races. Fernando Alonso bagged his third straight Q3 appearance. Esteban Ocon will start ninth, reaching Q3 after losing out in Q1 at Silverstone and the Hungaroring. Alex Albon will start in the top 10 after Verstappen’s penalty is applied. Pierre Gasly starts 12th, the same position he started this race last year. He’s been out-qualified by Ocon 10-4 this season. Daniel Ricciardo out-qualified his team mate in back-to-back races, but Yuki Tsunoda does have a grid penalty here. READ MORE: Why Alpine are looking to change their works status and take a customer engine supply Lance Stroll made Q3 at the last two races but couldn’t do so here after crashing in FP3, repaying his team with a Q2 slot. Both Haas cars were eliminated in Q1 for the first time since Monaco 2023. Nico Hulkenberg did out-qualify his team mate, to ensure their head-to-head reads 11-3 in the German’s favour. Tsunoda suffered his third Q1 elimination of the season, and his third Q1 elimination in four Belgian Grand Prix visits. Logan Sargeant was knocked out in Q1 for the first time since Austria. Zhou Guanyu was the slowest qualifier for the eighth time this season. © 2003-2024 Formula One World Championship Limited"}
{"story_name": "AS IT HAPPENED: Follow all the action from final practice for the Belgian Grand Prix", "story_url": "https://www.formula1.com/en/latest/article/live-coverage-third-practice-in-belgium-2024.5uDN4olhoZ3y06LWfC6sjd"}
{"story_content": "RACE 02 12 37 VIDEO     Charles Leclerc inherited pole for the Belgian Grand Prix thanks to Max Verstappen – who was fastest in qualifying – taking a 10-place grid penalty for Sunday's race. The Red Bull man topped all three qualifying sessions in Spa but will start from 11th place, while Leclerc's last ditch lap of 1m 53.754s (0.595s behind Verstappen's fastest Q3 effort) was enough to see him start at the front of the grid. READ MORE: Verstappen claims P1 in Belgium qualifying ahead of grid penalty as he heads Leclerc and Perez Verstappen's Red Bull team mate Sergio Perez will begin Sunday's Grand Prix in P2, a welcome return to form for the Mexican, while Lewis Hamilton will start P3. It was a change in fortunes for the McLaren duo of Lando Norris and Oscar Piastri who were fifth and sixth fastest respectively, meaning they will start the race from fourth and fifth. Click play on the video above to watch the highlights from a damp qualifying session in Spa. © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 12 21 REPORT Max Verstappen set the fastest time in qualifying for the Belgian Grand Prix, but the Dutchman will start from P11 due to a 10-place grid penalty for making a power unit change, meaning that Charles Leclerc will inherit pole position. Verstappen looked impressively quick as the session progressed and set an unbeatable lap of 1m 53.159s in the Red Bull, half a second clear of Ferrari’s Leclerc. Sergio Perez also enjoyed a better qualifying by putting his Red Bull into P3, ahead of Mercedes’ Lewis Hamilton in P4. Lando Norris and Oscar Piastri took fifth and sixth respectively for McLaren, with the Mercedes of George Russell following in seventh. Carlos Sainz claimed P8 for Ferrari, while his countryman Fernando Alonso went P9 in the Aston Martin and Esteban Ocon rounded out the top-10 for Alpine. Qualifying results Alex Albon only narrowly missed out on Q3 by just three thousandths of a second in the Williams, putting him in P11, and Pierre Gasly followed for Alpine in P12. Daniel Ricciardo took 13th place in the RB, putting him ahead of Kick Sauber’s Valtteri Bottas in 14th and Lance Stroll – whose Aston Martin was repaired in time to participate after his FP3 crash – in 15th. The Haas pair of Nico Hulkenberg and Kevin Magnussen had a disappointing day, having both exited in Q1 in 16th and 17th, while Yuki Tsunoda was also eliminated in 18th, though the RB driver had already been set to start from the back due to an engine penalty. Logan Sargeant ended the day down in P19 for Williams, while the Kick Sauber of Zhou Guanyu followed in 20th place. Leclerc will inherit pole position after Verstappen's grid penalty has been applied After rain limited running in the third and final practice hour earlier in the day, the track remained wet as qualifying approached at Spa-Francorchamps. Showers were not forecast to return until the end of the session, but the weather still posed something of an unknown factor. Uncertainty also surrounded whether Stroll would participate following his heavy crash in FP3. While the Canadian was fortunately all ok after the incident, the Aston Martin crew were hard at work fixing the damaged AMR24 in time for qualifying. Given that continued threat of rain, a queue of cars had formed in the pit lane ahead of Q1 getting underway, with everyone keen to put a lap on the board should the conditions change. Norris’ engineer explained the importance of the first lap due to further showers potentially arriving within minutes. All of the field had headed out on the intermediate tyres within the opening moments but the track looked to be posing challenges, with Hamilton reporting that there was “no grip”. However, it looked to be rapidly ramping up as the times continued to tumble. Bottas caught the eye by going up from last to sixth with around eight minutes left on the clock, while Gasly had impressively slotted into third. Meanwhile Norris was told, “Now or never for a new set, we think we should take a new set”, to which the Briton responded, “Okay, we box then”, as several drivers boxed for new intermediates. Hamilton reported that there was \"no grip\" during the opening minutes of qualifying With five minutes remaining, Verstappen displaced Piastri at the top of the timesheets while Norris, Zhou, Albon, Hulkenberg and Sargeant were in the danger zone, before Norris quickly hauled himself up the order into fifth. As the order continued to change, other big names found themselves at risk, including Russell in P17 as the session entered into its final minutes. Everybody had pitted for fresh intermediates – with the exception of Verstappen, seemingly feeling comfortable in P1. Russell surged up to third and into safety – though was eventually pushed down to seventh – while Piastri went quickest of all and Gasly took second. Perez also avoided another Q1 exit by going fourth fastest behind team mate Verstappen. While some front-runners looked to potentially be at risk at times, most ultimately avoided elimination but only just, with Norris in 12th and Hamilton in 13th. Others weren’t so lucky, though. The Haas pair of Hulkenberg and Magnussen exited in P16 and P17, followed by Tsunoda in P18, though the Japanese driver was already set to start from the back owing to an engine penalty. Sargeant was P19, while Zhou brought up the rear in P20. Knocked out: Hulkenberg, Magnussen, Tsunoda, Sargeant, Zhou Haas suffered a double Q1 elimination, with Hulkenberg down in P16 Intermediates remained the tyre of choice as Q2 began. Verstappen questioned whether rain had arrived again just a few minutes into the session, before being informed by his engineer that it was “very fine drizzle”. The track looked to be quickly drying out, with Norris pumping in a lap time one second up on his Q1 effort. Verstappen then went even faster on a lap of 1m 53.857s, putting him six tenths ahead of Norris. As the segment entered its final five minutes, the rain looked to have increased and there were again some notable names at risk, including Sainz and Leclerc. The Ferrari duo improved to go into the top five, before Perez then ended up in the drop zone in P11. While replays showed Piastri having a bit of a moment, the Australian still managed to put himself into second behind Verstappen. Perez, meanwhile, improved enough to secure a Q3 appearance – but, with others bettering their times, the Mexican was pushed down the order and eventually just made it in P10. This meant that Albon missed out by only three thousandths of a second, while Gasly also failed to make it through in P12. Also exiting were Ricciardo, Bottas and Stroll in 13th, 14th and 15th places. Knocked out: Albon, Gasly, Ricciardo, Bottas, Stroll Albon narrowly missed out on making it through to Q3 The Mercedes cars were at the front of the queue as the green light appeared for Q3, leading Hamilton to question if this was a good thing. “Depends on what this rain does,” was the response he received from his engineer. It was Verstappen who had gone fastest after the first runs and by some margin, with the Dutchman’s lap of 1m 53.159s putting him six tenths ahead of team mate Perez. Hamilton took third, from Piastri in fourth, Russell in fifth and Norris pushed down to sixth. While many cars returned to the pit lane following the opening laps, the Mercedes and McLaren drivers stayed out, seemingly to keep themselves safe should further heavy rain arrive. Most did not make drastic improvements, but Norris moved himself up to fourth ahead of Piastri. The rest of the field returned to action for their final efforts, but could anyone match Verstappen’s impressive benchmark? Leclerc bettered his time to go into second, yet this was still half a second clear of the Red Bull. Perez enjoyed his best qualifying in some weeks by taking third, ahead of Hamilton in fourth and the McLaren pair of Norris and Piastri in a disappointing fifth and sixth. The top-10 was completed by Russell, Sainz, Alonso and Ocon. Verstappen claimed P1 in qualifying for the Belgian Grand Prix, but a penalty will see him drop down to P11 \"That was a nice qualifying. Luckily the weather was ok – it was raining a little bit but at least we could do a decent qualifying,\" said Verstappen. \"Everything worked well, every tyre set that we were on we could do good lap times and I was also of course thinking about Q3, not knowing if it was going to dry out so was trying to keep two new sets for Q3 and luckily we escaped Q1 and Q2. \"So, yeah, very happy. The car was working quite well in the wet so I could just do my laps and try to do clean lap times in the wet which is always quite tricky. But tomorrow I know it’s going to be quite a different day. \"It’s going to be warmer, normally no rain, so it’s all about tyre degradation and we just need to make sure we’re good on that. But of course I have to start 10 places back so this is the best I could do today and then go from there. I don’t know how quick we’re going to be, I hope we can be in the mix to try and move forward.\" The 2024 Belgian Grand Prix is set to begin at 1500 local time on Sunday. Head to the RACE HUB to find out how you can catch the action from Spa-Francorchamps. © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 12 09 LIVE BLOG\nF1 UNLOCKED Special Contributor You'll unlock this article and get access to: Already have an account? © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 11 55 VIDEO     Max Verstappen set the fastest time as rain limited running in the final practice hour ahead of the Belgian Grand Prix, a session that was also earlier interrupted when Lance Stroll suffered a dramatic crash. Just over 10 minutes into FP3, Stroll aquaplaned and spun off heading through Eau Rouge before his Aston Martin hit the barriers. Fortunately the Canadian walked away, while the session was paused as his AMR24 was recovered. WATCH: Heavy Stroll crash brings out the red flags in FP3 amid pouring rain Another red flag followed soon afterwards due to the weather conditions and – while the action resumed for a final two minutes – Verstappen’s early lap of 2m 01.565s on the intermediate tyres remained at the top of the timesheets, 1.433s ahead of Oscar Piastri in second for McLaren. Watch what happened in FP3 at Spa by clicking go on the video above. © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 11 43 FEATURE\nF1 UNLOCKED Special Contributor There was a statistic doing the rounds in the paddock at the Circuit Gilles Villeneuve, back at the start of June. The Canadian Grand Prix would be our last standalone race until May 2025. For the next year, until Formula 1 next rocks up at the Miami International Autodrome, it’s doubles and triples all the way. That's a tantalising prospect for fans and one of the leading questions asked by F1 fans at this time of year – how do teams cope with these back-to-back races? Fans doing a pit-lane walk are often impressed – sometimes puzzled – when they see the pristine garage operating at one circuit, when they know a few days ago it was 1600km away at another circuit. It doesn’t pack down in an hour, it isn’t air-freighted and it isn’t magic – but it also isn’t the same garage. You'll unlock this article and get access to: Already have an account? © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 11 30 NEWS Pierre Gasly has thanked Bruno Famin for his efforts as Alpine’s Team Principal, ahead of another managerial reshuffle that will see him drop his F1 duties with the brand. Heading into the Belgian Grand Prix weekend, it was announced that Famin is to vacate his role by the end of August and instead oversee all other motorsport-related activities for the Renault Group at Viry-Chatillon. READ MORE: Alpine confirm Bruno Famin to leave his role as Team Principal It comes one year on from Famin replacing Otmar Szafnauer as team boss, with Spa-Francorchamps also the scene when the latter stepped away in one of many recent structural changes at the team.     Gasly thanks Famin as the Alpine boss prepares to step down With a new lead figure to be confirmed “in due course”, Gasly took a moment to speak about his time working alongside Famin, and the impact he has had on the operation. “Well, first of all, I want to thank Bruno,” commented Gasly following Friday’s pair of practice sessions in Belgium. READ MORE: Why Alpine are looking to change their works status and take a customer engine supply “It’s been a really good relationship with him for the time that I’ve spent in the team with him. He’s very honest, very transparent. “He’s still going to remain in the Alpine family, through a different role obviously, [but] I just want to thank him for his work and wish him all the best for the future.”     Famin explains why he’s stepping down as Alpine Team Principal Other changes at Alpine over the last few months include Technical Director Matt Harman and head of Aerodynamics Dirk de Beer departing, with David Sanchez subsequently arriving as Executive Technical Director. Then, in June, Flavio Briatore returned to the sport as Alpine’s Executive Advisor, with his task to “predominantly focus on top level areas of the team”. NEED TO KNOW: The most important facts, stats and trivia ahead of the 2024 Belgian Grand Prix Famin’s adjusted role at Alpine comes with the squad sitting eighth in the 2024 constructors’ standings on nine points, ahead of only Williams and Kick Sauber. Alpine confirm Bruno Famin to leave his role as Team Principal Norris ‘not feeling super comfortable’ despite leading McLaren 1-2 in Belgian GP practice Verstappen admits Spa ‘tricky’ to find the balance as he focuses on Sunday's race with looming grid penalty ‘It felt completely different’ – Hamilton rues change in performance for Mercedes after ‘pretty bad day’ at Spa Leclerc baffled by ‘difficult day to understand’ for Ferrari while Sainz predicts ‘headaches’ in Belgium © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 11 18 REPORT Red Bull’s Max Verstappen ended Saturday’s third and final practice session at the top of the timesheets, with running limited by persistent rain and a crash for Aston Martin driver Lance Stroll that brought out the red flags. After a largely dry first day at Spa-Francorchamps, showers overnight and through the morning made for a sodden track surface when FP3 began at 1230 local time – meaning drivers bolted on intermediate and wet tyres for their initial runs. PRACTICE DEBRIEF: Are McLaren favourites to repeat their one-two, or can Verstappen bounce back from his penalty in Spa? With a “big chunk” of rain forecast five to 10 minutes into the session, as per Daniel Ricciardo’s race engineer, plenty of cars hit the track early on to get some laps under their belts, bringing a range of lap times between the 2m and 2m 30s mark. Then, as predicted, the heavens opened and topped up the puddles all over the track – TV replays highlighting the challenge when both Lando Norris and Yuki Tsunoda were caught running wide and taking trips through the gravel at the Les Combes section. Practice 3 results A few moments later, the yellow flags were replaced by a red flag when Stroll lost control of his Aston Martin through Eau Rouge, snapped into the run-off area and thumped the inside wall, which caused significant car damage and put him out of the session. After Stroll’s car was cleared away, and the Canadian got taken to the Medical Centre for precautionary checks, the session resumed with some 40 minutes left on the clock – Verstappen’s early effort of 2m 01.565s still the benchmark. READ MORE: Why Alpine are looking to change their works status and take a customer engine supply No drivers were in a rush to head back out on track when the green light came back on at the end of the pit lane, though, with teams biding their time in the comfort of the pit lane as rain continued to fall and the track continued to get wetter. But there was another twist with 25 minutes remaining when the red flag appeared again due to the track conditions. The action eventually resumed with a couple of minutes left on the clock, allowing for some practice starts in the slippery conditions, but Verstappen remained on top via a time almost 20 seconds slower than Friday’s fastest lap in the dry. It was a wet final practice session at Spa-Francorchamps, with drivers kicking up plenty of spray Oscar Piastri was 1.4 seconds away in P2, with the Alpines of Pierre Gasly and Esteban Ocon sandwiching the other McLaren of Norris, and Ferrari driver Charles Leclerc rounding out the top six from the sidelined Stroll. Valtteri Bottas wound up eighth in his Kick Sauber, from Lewis Hamilton’s Mercedes and Sergio Perez’s Red Bull, with Alex Albon (Williams), Nico Hulkenberg (Haas) and Fernando Alonso (Aston Martin) in P11-P13 respectively. AS IT HAPPENED: Follow all the action from final practice for the Belgian Grand Prix RB pair Ricciardo and Tsunoda were 14th and 15th, while Sauber’s Zhou Guanyu and Williams’s Logan Sargeant were the last drivers to post a lap time, leaving Mercedes man George Russell, the Haas of Kevin Magnussen and the Ferrari of Carlos Sainz at the back of the pack. Drivers and teams will now debrief in the paddock and make any final set-up adjustments before qualifying later this afternoon, with the grid-deciding session – which looks set to feature more rain – scheduled to begin at 1600 local time. © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 11 03 VIDEO     The third and final practice hour ahead of the Belgian Grand Prix was brought to an early halt after a hefty crash for Lance Stroll just over 10 minutes into the session. With rain falling at Spa-Francorchamps, Stroll suffered a snap in the Aston Martin heading into Eau Rouge, before spinning off and making a sizeable impact into the barriers. LIVE COVERAGE: Follow all the action from final practice for the Belgian Grand Prix Fortunately Stroll walked away from the incident, but his AMR24 did not look to be in such good condition as the red flags were thrown to recover the car. Click go on the video player above to watch the incident unfold. © 2003-2024 Formula One World Championship Limited"}
{"story_content": "RACE 02 10 47 LIVE BLOG\nF1 UNLOCKED Special Contributor You'll unlock this article and get access to: Already have an account? © 2003-2024 Formula One World Championship Limited"}
